docs/jmeter/dcp-full-system-20000-donation.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="DCP Full System KYC to Disbursement with 20000 Donations" enabled="true">
      <stringProp name="TestPlan.comments">Synthetic full-system test. Bootstrap KYC/bank/project, send 20000 authenticated donation HTTP requests, then finalize committee/disbursement. No production blockchain, PayOS or private keys.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments"/></elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Runtime Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="protocol" elementType="Argument"><stringProp name="Argument.name">protocol</stringProp><stringProp name="Argument.value">${__P(protocol,http)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="host" elementType="Argument"><stringProp name="Argument.name">host</stringProp><stringProp name="Argument.value">${__P(host,localhost)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="port" elementType="Argument"><stringProp name="Argument.name">port</stringProp><stringProp name="Argument.value">${__P(port,4000)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="synthetic_token" elementType="Argument"><stringProp name="Argument.name">synthetic_token</stringProp><stringProp name="Argument.value">${__P(synthetic_token,)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="donation_amount_per_request" elementType="Argument"><stringProp name="Argument.name">donation_amount_per_request</stringProp><stringProp name="Argument.value">${__P(donation_amount_per_request,100)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="donation_request_count" elementType="Argument"><stringProp name="Argument.name">donation_request_count</stringProp><stringProp name="Argument.value">${__P(donation_request_count,20000)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="expected_total" elementType="Argument"><stringProp name="Argument.name">expected_total</stringProp><stringProp name="Argument.value">${__P(expected_total,2000000)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="disbursement_amount" elementType="Argument"><stringProp name="Argument.name">disbursement_amount</stringProp><stringProp name="Argument.value">${__P(disbursement_amount,10000)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <stringProp name="HTTPSampler.domain">${host}</stringProp><stringProp name="HTTPSampler.port">${port}</stringProp><stringProp name="HTTPSampler.protocol">${protocol}</stringProp><stringProp name="HTTPSampler.connect_timeout">5000</stringProp><stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true"><collectionProp name="Arguments.arguments"/></elementProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Synthetic Full Load Headers" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp>
          <elementProp name="Accept" elementType="Header"><stringProp name="Header.name">Accept</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp>
          <elementProp name="X-Synthetic-E2E-Token" elementType="Header"><stringProp name="Header.name">X-Synthetic-E2E-Token</stringProp><stringProp name="Header.value">${synthetic_token}</stringProp></elementProp>
          <elementProp name="X-Request-Id" elementType="Header"><stringProp name="Header.name">X-Request-Id</stringProp><stringProp name="Header.value">${__UUID}</stringProp></elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="1. Bootstrap KYC Bank Project" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="One bootstrap" enabled="true"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">1</stringProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp><stringProp name="ThreadGroup.ramp_time">0</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp><stringProp name="ThreadGroup.duration"></stringProp><stringProp name="ThreadGroup.delay"></stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Bootstrap KYC bank project ACTIVE" enabled="true">
          <stringProp name="HTTPSampler.path">/api/test/synthetic-e2e/full-load/bootstrap</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="body" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{"donationRequestCount":${donation_request_count},"donationAmountPerRequest":${donation_amount_per_request},"disbursementAmount":${disbursement_amount}}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Bootstrap returns HTTP 201" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="201">201</stringProp></collectionProp><stringProp name="Assertion.custom_message">Bootstrap must create the approved KYC/bank/project context.</stringProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract full-load run id" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">full_load_run_id</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data.runId</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp></JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract full-load project id" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">full_load_project_id</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data.projectId</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp></JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract donor access token" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">full_load_donor_access_token</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data.donorAccessToken</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp></JSONPostProcessor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Share context with donation threads" enabled="true"><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="parameters"></stringProp><stringProp name="filename"></stringProp><stringProp name="cacheKey">true</stringProp><stringProp name="script">props.put('full_load_run_id', vars.get('full_load_run_id')); props.put('full_load_project_id', vars.get('full_load_project_id')); props.put('full_load_donor_access_token', vars.get('full_load_donor_access_token'))</stringProp></JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="2. 20000 Donation Requests" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Donation requests per user" enabled="true"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">${__P(loops,100)}</stringProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(users,200)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(rampup,120)}</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp><stringProp name="ThreadGroup.duration"></stringProp><stringProp name="ThreadGroup.delay"></stringProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Donor Authorization" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="Authorization" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${__property(full_load_donor_access_token,)}</stringProp></elementProp></collectionProp></HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST donation one-click" enabled="true">
          <stringProp name="HTTPSampler.path">/donations/one-click</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="body" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{"projectId":"${__property(full_load_project_id,)}","amount":${donation_amount_per_request},"isAnonymous":true}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp>
        </HTTPSamplerProxy>
        <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Donation returns HTTP 200" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp><stringProp name="Assertion.custom_message">Every donation request must be accepted.</stringProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
      </hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="3. Committee and Disbursement" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="One finalize" enabled="true"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">1</stringProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp><stringProp name="ThreadGroup.ramp_time">0</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp><stringProp name="ThreadGroup.duration"></stringProp><stringProp name="ThreadGroup.delay"></stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Finalize committee disbursement" enabled="true">
          <stringProp name="HTTPSampler.path">/api/test/synthetic-e2e/full-load/finalize</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="body" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{"runId":"${__property(full_load_run_id,)}"}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Finalize returns HTTP 200" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp><stringProp name="Assertion.custom_message">The complete full-load flow must finish successfully.</stringProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Verify full-load totals and final statuses" enabled="true"><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="parameters"></stringProp><stringProp name="filename"></stringProp><stringProp name="cacheKey">true</stringProp><stringProp name="script">import groovy.json.JsonSlurper; def payload = new JsonSlurper().parseText(prev.getResponseDataAsString()); def data = payload.data ?: payload; def expected = [kyc:'APPROVED', bankAccount:'APPROVED', project:'ACTIVE', donation:'INDEXED', disbursement:'COMPLETED', payosTransfer:'SUCCESS']; def expectedCount = (vars.get('donation_request_count') ?: '20000') as BigDecimal; def expectedTotal = (vars.get('expected_total') ?: '2000000') as BigDecimal; if (data.finalStatus != expected || (data.donationRequestCount as BigDecimal) != expectedCount || (data.donationTotalAmount as BigDecimal) != expectedTotal || !(data.totalDurationMs instanceof Number)) { AssertionResult.setFailure(true); AssertionResult.setFailureMessage("Unexpected full-load result: ${data}") }</stringProp></JSR223Assertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true"><boolProp name="ResultCollector.error_logging">false</boolProp><objProp><name>saveConfig</name><value class="SampleSaveConfiguration"><time>true</time><latency>true</latency><timestamp>true</timestamp><success>true</success><label>true</label><code>true</code><message>true</message><threadName>true</threadName><dataType>true</dataType><encoding>false</encoding><assertions>true</assertions><responseData>false</responseData><samplerData>false</samplerData><xml>false</xml><fieldNames>true</fieldNames><responseHeaders>false</responseHeaders><requestHeaders>false</requestHeaders><saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage><assertionsResultsToSave>0</assertionsResultsToSave><url>true</url><threadCounts>true</threadCounts><idleTime>true</idleTime><connectTime>true</connectTime></value></objProp><stringProp name="filename"></stringProp></ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>